app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories` ORDER BY parent_id asc LIMIT 10 OFFSET 0
---
  def index
    @categories = Category.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:per_page => 10, :page => params[:page])

INSERT INTO `categories` (`created_at`, `lft`, `name`, `parent_id`, `rgt`, `updated_at`) VALUES ('2013-02-13 12:48:53', 9, 'inner child 2', 4, 10, '2013-02-13 12:48:53')
---
  def create
    @category = Category.new(params[:category])
    if @category.save