app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.column_for_attribute(:gender).limit
    if @user.save
---
INSERT INTO `users` (`created_at`, `crypted_password`, `current_login_at`, `current_login_ip`, `email`, `failed_login_count`, `first_name`, `gender`, `is_active`, `last_login_at`, `last_login_ip`, `last_name`, `last_request_at`, `login`, `login_count`, `password_salt`, `perishable_token`, `persistence_token`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `photo_updated_at`, `single_access_token`, `updated_at`) VALUES ('2013-01-01 11:11:42', '7f0f5a531d2499fe7f5bb2699e04bd5bfcdd3e93e63d76e996e616bedb6d0a32d196b9ce6b2e63b735debcff138f79787097164d3621e68b3ec8530d36841a14', '2013-01-01 11:11:42', '192.168.0.53', 'sanjay@virtueinfo.com', 0, 'sanjay', 'Male', '1', NULL, NULL, 'rathod', '2013-01-01 11:11:42', 'sanjay', 1, '1ItFXoDY0sr85i82Bfm', 'RzPB5ORMm0OqmVcmZLqa', '1d3077c822b3307235e88b44a4fb2b19f29f48f957eb830a4d4d2f52b812d75fa73c185bb5c083a043297ce9a5786f1db9ab178bab42347919d9f60853495099', 'image/jpeg', '1334744165.JPG', 111361, '2013-01-01 11:11:41', 'xUldkfNPE2ZYRc4eeopL', '2013-01-01 11:11:42')

  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `photo_file_name` = '1371132652.jpg', `photo_file_size` = 1688067, `photo_updated_at` = '2013-07-23 10:47:18', `perishable_token` = 'BU4MO1y49fOE8idjkiBH', `updated_at` = '2013-07-23 10:47:19' WHERE `users`.`id` = 1